<template>
  <el-dialog
    :visible="visible"
    v-if="visible"
    top='6vh'
    title="用户协议"
    width="900px"
    v-dialogDrag
    destroy-on-close
    :before-close='handleBeforeDiaClose'
    custom-class="mp-register-user-agreement-wrap"
   >
   <article>
     <header>欢迎您申请并使用郑州名片之家电子商务有限公司及其他合作运营主体（以下简称“名片之家”）提供的服务。
       为使用名片之家平台及服务，以及服务中包含的各种业务功能，您应当仔细阅读并遵守《名片之家用户协议》（以下简称“本协议”）以及《名片之家权责声明》。
       您在本平台上注册、登录、使用即视为您已充分阅读并完全自愿接受本用户服务协议的各项内容，包括名片之家对本协议随时所做的修订，并成为名片之家用户。
       如果您未满18周岁，请在法定监护人的陪同下阅读本协议及其他上述协议。</header>
     <section>
       <header>一、名片之家服务说明</header>
       <div>
         <ul>
           <li>1. 服务宗旨：以客户为中心，帮助客户创造价值回报。</li>
           <li>2. 服务主体：本服务由名片之家为您提供。本协议项下的“名片之家”根据不同的语境可能指名片之家网页、移动端及围绕名片之家业务提供的相关技术服务。
             “用户”是指注册、登录、使用名片之家及服务的使用人，在本协议中更多地称呼为“您”。</li>
           <li>3. 服务内容：名片之家是500万广告设计机构印刷服务商，为合作客户提供多产品体系的优印解决方案。</li>
           <li>4. 服务平台：名片之家提供的服务包括但不限于域名为www.mpzj.cn的网站、下单系统，以及其它移动端服务，让您可以方便快捷解决印刷问题。</li>
           <li>5. 服务许可范围：
             <p>（1） 名片之家赋予您一项非排他性的、非独家的、不可转让的、不可转许可的授权，以使用本网站。</p>
             <p>（2） 本协议未明示授权的其他一切权利仍由名片之家保留，您在行使这些权利时须另外取得名片之家的书面许可。名片之家未行使或执行本协议任何权利或规定，不构成对该权利的放弃。</p>
           </li>
         </ul>
       </div>
     </section>
     <section>
       <header>二、用户账号</header>
       <div>
         <p>我们深知个人信息对您的重要性，并会尽全力保护您的个人信息安全。我们在本协议中所提及的收集、使用、管理、共享及转让的个人信息包括个人电话等敏感信息以及其他个人信息。
           希望您在使用我们的服务前务必仔细阅读并确认您已经充分理解本协议所载内容，您点击同意后即视为您接受本协议的内容，并同意授权我们按照本政策收集、使用、保存和共享您的相关信息。</p>
         <ul>
           <li>
             <h2>1. 账号注册</h2>
             <p>1.1 为了使用名片之家服务，用户需要注册一个账号。您需提供个人真实信息完成账号注册和密码设置，为保证您享用的平台服务安全有效且不断优化，您同意授权名片之家对您的个人信息进行验证和合理使用。</p>
             <p>1.2 您需对您提供的注册资料的真实性、准确性、合法性负责，并及时更新您的资料。若您提供任何违法、不道德或名片之家认为严禁印刷的资料，或是名片之家有理由怀疑您的资料属于恶意程序或恶意操作，
               名片之家有权暂停或终止您的账号，并拒绝您于现在和未来使用本服务之全部或任何部分。</p>
             <p>1.3 名片之家无须对任何用户的任何登记资料承担任何责任，包括但不限于鉴别、核实任何登记资料的真实性、正确性、完整性、适用性及/或是否为最新资料的责任。</p>
             <p>1.4 为遵从国家法律法规要求、内容审计或追偿等目的，名片之家将依法留存用户账号相关的信息。您理解并同意，用户注销账号或由于其他原因导致名片之家删除用户账号的，
               用户与名片之家在服务协议中关于知识产权、违约责任、法律适用和争议解决方式等约定并不随账号的注销或删除而终止。</p>
           </li>
           <li>
             <h2>2. 用户账号安全</h2>
             <div>完成本服务的注册程序并成功注册之后，您可使用您的手机号和密码，登录到您在名片之家的账号。保护您的账号安全，是您的责任。您同意：</div>
             <p>（1） 您应对所有使用您的密码及账号的活动负完全的责任，包括但不限于您在名片之家中进行的任何数据修改、款项支付、传单下单等行为。
               您应高度重视对账号与密码的保密，在任何情况下不向他人透露账号及密码。您的名片之家账号遭到未获授权的使用，或者发生其它任何安全问题时，您将立即通知名片之家。</p>
             <p>（2） 如果您未保管好自己的账号和密码，因此而产生的任何损失或损害，名片之家无法也不承担任何责任。</p>
             <p>（3） 您有责任维护个人账号、密码的安全性与保密性，并对您以注册账号名义所从事的活动承担全部法律责任。如果您未保管好自己的账号和密码而对您、名片之家或第三方造成的损害，您将负全部责任。</p>
           </li>
          </ul>
       </div>
     </section>
     <section>
       <header>三、用户个人信息保护</header>
       <div>
         <ul>
           <li>1. 保护用户个人信息是名片之家的一项基本原则，名片之家将会采取合理的措施保护用户的个人信息。您知悉并同意，为方便您使用本平台相关服务，本平台将按照本协议的规定收集、使用、存储您的个人信息与必要信息，
             包括但不限于您的登记资料、下单记录、付款情况等。除法律法规规定、《权责声明》约定或另有约定的情形外，未经您的许可名片之家不会获取、存储或向第三方公开、透露您的个人信息。</li>
           <li>2. 您知悉并确认，您在注册账号或使用本平台的过程中，需要提供真实的身份信息，名片之家将根据国家法律法规的要求，采用邮箱、移动电话等进行真实身份信息认证。若您提供的信息不真实、不完整，
             则无法使用本平台或在使用过程中受到限制，由此产生的不利后果，由您自行承担。</li>
           <li>3. 名片之家将运用各种安全技术和程序、建立完善的管理制度来保护您的个人信息，防止您的信息被不当使用或遭受未经授权的访问、使用或披露。</li>
           <li>4. 未经您的同意，名片之家不会向其他任何公司、组织和个人披露您的个人信息，除非：
             <p>（1）相关法律法规或司法机关、行政机关要求；</p>
             <p>（2）为完成合并、分立、收购或资产转让而转移；</p>
             <p>（3）为提供您要求的服务所必须。</p>
           </li>
         </ul>
       </div>
     </section>
     <section>
       <header>四、用户行为规范</header>
       <div>
         <ul>
           <li>
             <h4>1. 信息内容规范</h4>
             <div>您应对使用名片之家平台及服务提供信息内容的真实性、合法性负责。如需获得该信息内容权利人或任何有权第三方的事先授权或批准的，应事先获得该等授权或批准；一旦您上传某项信息内容，
               将被视为您已事先获得该等授权或批准。您理解并同意，名片之家一直致力于为用户提供文明健康、规范有序的印刷环境，
               <strong>您不得利用名片之家制作、发布、传播任何违法违规内容，包括但不限于：</strong></div>
             <p><strong>（1）反对宪法所确定的基本原则的；</strong></p>
             <p><strong>（2）危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一，损害国家荣誉和利益的；</strong></p>
             <p><strong>（3）煽动民族仇恨、民族歧视、破坏民族团结的；</strong></p>
             <p><strong>（4）破坏国家宗教政策，宣扬邪教和封建迷信的；</strong></p>
             <p><strong>（5）散布谣言，扰乱社会秩序，破坏社会稳定的；</strong></p>
             <p><strong>（6）散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；</strong></p>
             <p><strong>（7）侮辱或者诽谤他人，侵害他人合法权利的；</strong></p>
             <p><strong>（8）含有虚假、诈骗、有害、胁迫、侵害他人隐私、骚扰、侵害、中伤、粗俗、猥亵、或其它道德上令人反感的内容；</strong></p>
             <p><strong>（9）侵犯他人隐私、个人信息、著作权、商标权等知识产权或合法权利的内容；</strong></p>
             <p><strong>（10）含有中国法律、法规、规章、条例以及任何具有法律效力之规范所限制或禁止的其它内容的或含有名片之家认为不适合展示的内容。</strong></p>
           </li>
           <li>
             <h4>2. 软件使用规范</h4>
             <section>
               <header>2.1 您同意按照本协议约定的方式合理合法地使用名片之家，除非法律允许或名片之家书面许可，您通过名片之家浏览、分享、下载、使用的任何内容，
                 仅限您个人使用，您不得有偿或无偿转让依本协议条款所取得的用户权利，且不得从事下列行为：</header>
                <ul>
                  <li>（1）使用未经名片之家提供或认可的第三方软件、插件、外挂、系统、设备等登录或使用本服务</li>
                  <li>（2）对名片之家拥有知识产权的内容进行销售、出租、出借、复制、修改、链接、转载、汇编、发表、出版等；</li>
                  <li>（3）对本软件进行反向工程、反向汇编、反向编译，或者以其他方式尝试发现本软件的源代码；</li>
                  <li>（4）未经合法授权而截获、篡改、收集、储存或删除他人个人信息、站内邮件或其它数据资料，或将获知的此类资料用于任何非法或不正当目的；</li>
                  <li>（5）对本软件或者本软件运行过程中释放到任何终端内存中的数据、软件运行过程中客户端与服务器端的交互数据，以及本软件运行所必需的系统数据，进行复制、修改、增加、删除、挂接运行或创作任何衍生作品，
                    形式包括但不限于使用插件、外挂或非经名片之家授权的第三方工具/服务接入本软件和相关系统；</li>
                  <li>（6）通过修改或伪造软件运行中的指令、数据，增加、删减、变动软件的功能或运行效果，或者将用于上述用途的软件、方法进行运营或向公众传播，无论这些行为是否为商业目的；</li>
                  <li>（7）通过非名片之家开发、授权的第三方软件、插件、外挂、系统，登录或使用名片之家平台及服务，或制作、发布、传播上述工具；</li>
                  <li>（8）自行或者授权他人、第三方软件对本软件及其组件、模块、数据进行干扰；</li>
                  <li>（9）使用任何方式（包括但不限于第三方软件、插件、外挂、系统、设备等）对名片之家进行干扰、破坏、修改或实施其他任何危害网络安全的活动；</li>
                  <li>（10）其他违反法律法规、政策或未经名片之家明示授权的行为；</li>
                </ul>
             </section>
             <section>
               2.2 除本协议约定外，名片之家还将在服务平台内以各种形式提醒用户规范使用名片之家提供的各项服务，您须遵守。您已认可名片之家未对用户的使用行为进行全面控制，您使用任何内容时，包括依赖前述内容之正确性、
               完整性或合法性时，您同意将自行加以判断并承担所有风险，名片之家在法律允许的范围内不对您因前述风险而导致的任何损失或损害承担责任。在任何情况下，若名片之家有理由认为您的任何行为违反或可能违反上述约定的，
               名片之家可独立进行判断并处理，且有权在未经通知的情况下终止向您提供服务，并追究相关责任。若您违反本协议约定使用名片之家提供的服务而被第三方追责的，由您自行承担全部责任。
             </section>
           </li>
         </ul>
       </div>
     </section>
     <section>
       <header>五、违约处理</header>
       <div>
         <ul>
           <li>1. 如果名片之家发现或收到他人举报投诉您违反本协议或存在任何恶意行为的，名片之家有权不经通知随时对相关内容进行删除、屏蔽，并视行为情节对违规账号处以包括但不限于警告、限制或禁止使用全部或部分功能、账号封禁、
             注销等处罚，并公告处理结果。名片之家有权对涉嫌违反法律法规、涉嫌违法犯罪的行为保存有关记录，并依法向有关主管部门报告、配合有关主管部门调查。对已删除内容公司有权不予返还。</li>
           <li>2. 因您违反本协议或其他条款规定，引起第三方投诉或诉讼索赔的，您应当自行承担全部法律责任。因您的违法或违约行为导致名片之家及其关联公司向任何第三方赔偿或遭受国家机关处罚的，
             您还应足额赔偿名片之家及其关联公司因此遭受的全部损失。</li>
           <li>3. 公司尊重并保护法人、公民的知识产权、名誉权、姓名权、隐私权等合法权益。您保证，在使用名片之家上传的制作稿、资料等不侵犯任何第三方的知识产权、名誉权、姓名权、隐私权等权利及合法权益。否则，
             名片之家有权在收到权利方或者相关方通知的情况下移除该涉嫌侵权内容。针对第三方提出的全部权利主张，您应自行承担全部法律责任；如因您的侵权行为导致名片之家及其关联公司遭受损失的（包括但不限于经济、商誉等损失），
             您还应足额赔偿名片之家及其关联公司遭受的全部损失。</li>
         </ul>
       </div>
     </section>
     <section>
       <header>六、服务的中断和终止</header>
       <div>
         <ul>
           <li>1. 您理解并同意，名片之家有权于任何时间暂时或永久修改或终止本服务（或其任何部分），且无论通知与否。您同意对于本服务所作的任何修改、暂停或终止，名片之家对您和任何第三人均无需承担任何责任，
             您应妥善做好数据更新、备份与转移工作。</li>
           <li>2. 因您违反本协议，名片之家有权根据实际情况中断或终止其中一项或多项服务，严重违反的，名片之家将直接终止您对名片之家相关平台的使用权。</li>
           <li>3. 您对本协议内容有异议，或对名片之家提供的服务不满意，可行使如下权利：
             <p>（1）停止使用名片之家账号服务；</p>
             <p>（2）自行注销或通知名片之家注销您的账号。账号注销将导致您在名片之家上的个人信息、下单记录，付款情况等一并删除，您和名片之家相应的权利义务随之终止（您的任何损害赔偿义务不会因此而终止），
               名片之家不承担传送任何未处理的信息或未完成的服务给您的责任。</p>
           </li>
         </ul>
       </div>
     </section>
     <section>
       <header>七、第三方产品及服务</header>
       <div>
         <ul>
           <li>1. 您在使用本软件中由第三方提供的产品或服务时，除遵守本协议约定外，还应遵守第三方的用户协议。如因您使用由第三方提供的产品或服务时引发的任何纠纷，应由您和第三方负责解决，名片之家不承担任何责任。</li>
           <li>2. 您在使用本软件中由第三方提供的产品或服务时，本软件可能会调用第三方系统或者通过第三方支持用户的使用或访问，使用或访问的结果由该第三方提供，名片之家不保证通过第三方提供服务及内容的安全性、
             准确性、有效性及其他不确定的风险，由此若引发的任何争议及损害，与名片之家无关，名片之家不承担任何责任。</li>
         </ul>
       </div>
     </section>
     <section>
       <header>八、广告</header>
       <div>
         <ul>
           <li>1. 名片之家中可能包含广告，这属于名片之家及其关联公司合理合法的商业模式，您同意在使用名片之家过程中接收由名片之家及其关联公司或者其第三方合作伙伴发布的广告信息或其他信息（包括商业与非商业信息），
             信息的具体发送及展示形式、频次及内容等以名片之家实际提供为准。</li>
         </ul>
       </div>
     </section>
     <section>
       <header>九、其他条款</header>
       <div>
         <ul>
           <li>1. 名片之家有权依据国家政策、技术条件、产品功能等变化需要而进行修改本协议，并将修改后的协议予以发布。本协议条款变更后，如果您继续使用名片之家，即视为您已接受修改后的协议。
             本协议内容同时包括名片之家已经发布及后续可能不断发布的相关协议、规则等内容（包括但不限于《用户协议》）。前述内容已经发布，公司将以适当的方式（网站公布、系统通知等）提醒您及时阅读。
             前述相关协议、规则构成本协议不可分割的组成部分，您应同样遵守。</li>
            <li>2. 除非本协议另有其它明示规定，名片之家增加或强化目前任何新功能，包括所推出的新产品，均受到本使用协议之规范。</li>
            <li>3. 本协议的成立、生效、履行、解释及争议解决均适用中华人民共和国的法律。</li>
            <li>4. 名片之家对于您所有的通知均可通过网页公告、页面提示、弹窗、消息通知、公众号通知、您预留的联系方式（电子邮件、手机短信等）等多种方式进行通知，该通知自名片之家发送之时视为已完成送达。
              如以多种方式通知，则送达时间以最早送达之时为准。</li>
         </ul>
       </div>
     </section>
     <footer>
       <el-button @click="handleBeforeDiaClose">关闭</el-button>
     </footer>
   </article>
  </el-dialog>
</template>

<script>
export default {
  props: {
    value: {
      type: Boolean,
      default: false,
    },
  },
  model: {
    prop: 'value',
    event: 'change',
  },
  computed: {
    visible: {
      get() {
        return this.value;
      },
      set(bool) {
        this.$emit('change', bool);
      },
    },
  },
  methods: {
    handleBeforeDiaClose() {
      this.$emit('change', false);
    },
  },
};
</script>

<style lang='scss'>
.mp-register-user-agreement-wrap {
  > .el-dialog__header {
    height: 45px;
    box-sizing: border-box;
    padding: 14px 10px;
    padding-left: 23px;
    margin: 0 10px;
    border-bottom: 1px solid #e5e5e5;
    > .el-dialog__title {
      font-size: 16px;
      color: #333;
      line-height: 16px;
      height: 16px;
    }
    > .el-dialog__headerbtn {
      top: 8px;
      font-size: 20px;
    }
    position: relative;
    &::before {
      content: '';
      position: absolute;
      height: 16px;
      width: 3px;
      background-color: #428dfa;
      left: 10px;
      top: 15px;
    }
  }
  > .el-dialog__body {
    padding-top: 18px;
    max-height: 755px;
    overflow: auto;
    box-sizing: border-box;
    > article {
      font-size: 14px;
      line-height: 24px;
      > header {
        color: #333;
      }
      > section {
        > header {
          color: #333;
          font-weight: 700;
          padding-top: 10px;
          padding-bottom: 8px;
        }
        > div {
          > p {
            margin-bottom: 6px;
            color: #666;
          }
          > ul {
            > li {
              line-height: 24px;
              padding-bottom: 1px;
              color: #666;
              h2 {
                font-weight: 700;
              }
            }
          }
        }
      }
      > footer {
        text-align: center;
        margin-top: 23px;
        > button {
          width: 110px;
          height: 35px;
          padding: 0;
          color: #428dfa;
          border-color: #428dfa;
        }
      }
      strong {
        font-weight: 700;
        color: #444;
      }
    }
  }
}
</style>
